Documents/ESB/ESB_Consumer_0911/003TestSample/SAMPLE_XML_MUST/eLoan/EL19_LoanCtrctAddRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/eLoan/LoanCtrctAddRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>eLoan</ServiceDomain>  
      <OperationName>LoanCtrctAdd</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:LoanCtrctAddRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>EL19</v11:TxnId>  
        <v11:TxnNo>af3a317b-1720-4faa-983f-62855b9be0f9DAdUCFBdVg9d</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CustPermId>S999999999</v11:CustPermId>  
        <v11:AppRefNo>YYYYMMDD999SS9999</v11:AppRefNo>  
        <v11:AppNo>YYYYMMDD999SS9999S</v11:AppNo>  
        <!--Optional:-->  
        <v11:GrntedRslt>1</v11:GrntedRslt>  
        <!--Optional:-->  
        <v11:AuthType>1</v11:AuthType>  
        <!--Optional:-->  
        <v11:IdntyVrfyType>1</v11:IdntyVrfyType>  
        <!--Optional:-->  
        <v11:IdntyVrfyDate>yyyy-MM-ddTHH:mm:ssZ</v11:IdntyVrfyDate>  
        <!--Optional:-->  
        <v11:RvwDate>yyyy-MM-dd</v11:RvwDate>  
        <!--Optional:-->  
        <v11:SgntrDate>yyyy-MM-dd</v11:SgntrDate>  
        <!--Optional:-->  
        <v11:IdntyVrfyFlg>1</v11:IdntyVrfyFlg>  
        <!--Optional:-->  
        <v11:IdntyVrfyTellerDate>yyyy-MM-ddTHH:mm:ssZ</v11:IdntyVrfyTellerDate> 
      </v11:ServiceBody> 
    </v11:LoanCtrctAddRq> 
  </soap:Body> 
</soap:Envelope>
